optimization/AVC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     reactingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.006;

deltaT          1e-05;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      2;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       0.0001;

functions
{
    residuals
    {
        type            solverInfo;
        libs            ( utilityFunctionObjects );
        fields          ( U p T k epsilon );
        writeResidualFields no;
    }
    minMaxT
    {
        type            fieldMinMax;
        libs            ( fieldFunctionObjects );
        fields          ( T );
        writeControl    timeStep;
        writeInterval   100;
    }
    minMaxTurbulence
    {
        type            fieldMinMax;
        libs            ( fieldFunctionObjects );
        fields          ( k epsilon nut );
        writeControl    timeStep;
        writeInterval   10;
    }
}


// ************************************************************************* //
