optimization/AVC/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 400;  // Consistent with k=2.0 and higher velocities

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform 421;  // epsilon = Cmu^0.75 * k^1.5 / L for U=25m/s
    }

    inletFuel
    {
        type            fixedValue;
        value           uniform 1418;  // epsilon = Cmu^0.75 * k^1.5 / L for U=37.5m/s
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    vanes
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    frontBody
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    rearBody
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
