optimization/AVC/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.05;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
    }

    Yi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.05;
    }

    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.1;
    }

    GFinal
    {
        $G;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;

    maxDeltaT           1e-4;
    maxCo               0.5;   // Reduced from 0.15 to 0.1 for more stability
    alphaTemp           0.05;  // Reduced from 0.05 for tighter temperature control
    alphaY              0.05;  // Reduced from 0.05 for tighter species control
    Yref
    {
        O2                  0.1;
        CH4                 0.1;
    }
    rDeltaTSmoothingCoeff   0.05;   // Increased from 0.025 for smoother time step changes
    rDeltaTDampingCoeff     1;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
        "k.*"           0.7;  // Under-relax k equation for stability
        "epsilon.*"     0.7;  // Under-relax epsilon equation for stability
    }
}


// ************************************************************************* //
